//Написать метод - калькулятор

void Calculat(int firstValue, int secondValue)
{
    Console.WriteLine(firstValue + secondValue);
}

Calculat(-1, 3);

//Результат работы программы:
//2
