//Написать программу,
//чтобы она выводила следующую последовательность 5 12 19 26 33 40 47 54 61 68 75 82 89 96.

for (int i = 5; i <= 96; i = i + 7)
{
    Console.WriteLine(i);
}

//Результат работы программы:
//5
//12
//19
//26
//33
//40
//47
//54
//61
//68
//75
//82
//89
//96